初步查看数据集

In [1]:
import pandas as pd

In [2]:
user_file = "../data/jddata/JData_User.csv"
product_file = "../data/jddata/JData_Product.csv"
comment_file = "../data/jddata/JData_Comment.csv"
action_file_02 = "../data/jddata/JData_Action_201602.csv"
action_file_03 = "../data/jddata/JData_Action_201603.csv"
action_file_04 = "../data/jddata/JData_Action_201604.csv"

In [3]:
user_file_pd = pd.read_csv(user_file)
print(user_file_pd.shape)
user_file_pd.describe()

(105321, 5)

             user_id            age            sex     user_lv_cd
count  105321.000000  105318.000000  105318.000000  105321.000000
mean   252661.000000       2.773448       1.112887       3.850030
std     30403.698188       1.672182       0.955930       1.071505
min    200001.000000      -1.000000       0.000000       1.000000
25%    226331.000000       3.000000       0.000000       3.000000
50%    252661.000000       3.000000       2.000000       4.000000
75%    278991.000000       4.000000       2.000000       5.000000
max    305321.000000       6.000000       2.000000       5.000000

In [4]:
user_file_pd.user_id.unique().size

105321

In [5]:
print(user_file_pd.head(5))
print(user_file_pd.isna().sum())
print(user_file_pd.info())
print(user_file_pd[user_file_pd.age.isna()])

   user_id  age  sex  user_lv_cd user_reg_tm
0   200001  6.0  2.0           5  2016-01-26
1   200002 -1.0  0.0           1  2016-01-26
2   200003  4.0  1.0           4  2016-01-26
3   200004 -1.0  2.0           1  2016-01-26
4   200005  2.0  0.0           4  2016-01-26
user_id        0
age            3
sex            3
user_lv_cd     0
user_reg_tm    3
dtype: int64
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105321 entries, 0 to 105320
Data columns (total 5 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   user_id      105321 non-null  int64
 1   age          105318 non-null  float64
 2   sex          105318 non-null  float64
 3   user_lv_cd   105321 non-null  int64
 4   user_reg_tm  105318 non-null  object
dtypes: float64(2), int64(2), object(1)
memory usage: 4.0+ MB
None
       user_id  age  sex  user_lv_cd user_reg_tm
34072   234073  NaN  NaN           1         NaN
38905   238906  NaN  NaN           1         NaN
67704   267705  NaN  NaN           1         NaN

In [6]:
user_file_pd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105321 entries, 0 to 105320
Data columns (total 5 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   user_id      105321 non-null  int64
 1   age          105318 non-null  float64
 2   sex          105318 non-null  float64
 3   user_lv_cd   105321 non-null  int64
 4   user_reg_tm  105318 non-null  object
dtypes: float64(2), int64(2), object(1)
memory usage: 4.0+ MB

In [7]:
product_file_pd = pd.read_csv(product_file)

In [8]:
print(product_file_pd.shape)

(24187, 6)

In [9]:
product_file_pd.describe()

,sku_id,a1,a2,a3,cate,brand
count,24187.000000,24187.000000,24187.000000,24187.000000,24187.0,24187.000000
mean,85398.737421,2.176996,0.938975,1.179766,8.0,435.864307
std,49238.799482,1.176116,0.969517,1.045883,0.0,225.749190
min,6.000000,-1.000000,-1.000000,-1.000000,8.0,3.000000
25%,42476.000000,1.000000,1.000000,1.000000,8.0,214.000000
50%,85616.000000,3.000000,1.000000,1.000000,8.0,489.000000
75%,127774.000000,3.000000,2.000000,2.000000,8.0,571.000000
max,171224.000000,3.000000,2.000000,2.000000,8.0,922.000000

In [10]:
product_file_pd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24187 entries, 0 to 24186
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sku_id  24187 non-null  int64
 1   a1      24187 non-null  int64
 2   a2      24187 non-null  int64
 3   a3      24187 non-null  int64
 4   cate    24187 non-null  int64
 5   brand   24187 non-null  int64
dtypes: int64(6)
memory usage: 1.1 MB

In [ ]:
# comment_file = "../data/jddata/JData_Comment.csv"

In [11]:
comment_file_pd = pd.read_csv(comment_file)

In [12]:
comment_file_pd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 558552 entries, 0 to 558551
Data columns (total 5 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   dt                558552 non-null  object
 1   sku_id            558552 non-null  int64
 2   comment_num       558552 non-null  int64
 3   has_bad_comment   558552 non-null  int64
 4   bad_comment_rate  558552 non-null  float64
dtypes: float64(1), int64(3), object(1)
memory usage: 21.3+ MB

In [ ]:
# action_file_02 = "../data/jddata/JData_Action_201602.csv"

In [13]:
action_file_02_pd = pd.read_csv(action_file_02)

In [14]:
action_file_02_pd.shape

(11485424, 7)

In [15]:
action_file_02_pd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11485424 entries, 0 to 11485423
Data columns (total 7 columns):
 #   Column    Dtype
---  ------    -----
 0   user_id   int64
 1   sku_id    int64
 2   time      object
 3   model_id  float64
 4   type      int64
 5   cate      int64
 6   brand     int64
dtypes: float64(1), int64(5), object(1)
memory usage: 613.4+ MB

In [16]:
action_file_02_pd.isna().sum()

user_id           0
sku_id            0
time              0
model_id    4959617
type              0
cate              0
brand             0
dtype: int64

In [17]:
action_file_02_pd[action_file_02_pd.model_id.isna()].head(5)

   user_id  sku_id                 time  model_id  type  cate  brand
0   266079  138778  2016-01-31 23:59:02       NaN     1     8    403
2   200719   61226  2016-01-31 23:59:07       NaN     1     8     30
4   263587   72348  2016-01-31 23:59:08       NaN     1     5    159
5   296130  103126  2016-01-31 23:59:11       NaN     1     4    174
9   283139    4732  2016-01-31 23:59:14       NaN     1     6    375

In [18]:
action_file_02_pd.head(5)

   user_id  sku_id                 time  model_id  type  cate  brand
0   266079  138778  2016-01-31 23:59:02       NaN     1     8    403
1   266079  138778  2016-01-31 23:59:03       0.0     6     8    403
2   200719   61226  2016-01-31 23:59:07       NaN     1     8     30
3   200719   61226  2016-01-31 23:59:08       0.0     6     8     30
4   263587   72348  2016-01-31 23:59:08       NaN     1     5    159

In [19]:
action_file_02_pd.describe()

,user_id,sku_id,model_id,type,cate,brand
count,1.148542e+07,1.148542e+07,6.525807e+06,1.148542e+07,1.148542e+07,1.148542e+07
mean,2.524416e+05,8.379134e+04,9.612351e+01,3.948194e+00,6.331354e+00,4.327179e+02
std,2.990617e+04,4.982075e+04,1.023377e+02,2.439923e+00,1.811247e+00,2.446622e+02
min,2.000020e+05,2.000000e+00,0.000000e+00,1.000000e+00,4.000000e+00,4.000000e+00
25%,2.270090e+05,4.084500e+04,0.000000e+00,1.000000e+00,4.000000e+00,2.140000e+02
50%,2.512080e+05,8.116300e+04,2.700000e+01,6.000000e+00,6.000000e+00,4.530000e+02
75%,2.782880e+05,1.271520e+05,2.160000e+02,6.000000e+00,8.000000e+00,6.300000e+02
max,3.053210e+05,1.712250e+05,3.480000e+02,6.000000e+00,1.100000e+01,9.230000e+02

In [20]:
action_file_03 = "../data/jddata/JData_Action_201603.csv"

In [21]:
action_file_03_pd = pd.read_csv(action_file_03)

In [22]:
action_file_03_pd.shape

(25916378, 7)

In [23]:
action_file_03_pd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25916378 entries, 0 to 25916377
Data columns (total 7 columns):
 #   Column    Dtype
---  ------    -----
 0   user_id   int64
 1   sku_id    int64
 2   time      object
 3   model_id  float64
 4   type      int64
 5   cate      int64
 6   brand     int64
dtypes: float64(1), int64(5), object(1)
memory usage: 1.4+ GB

In [24]:
action_file_03_pd.isna().sum()

user_id            0
sku_id             0
time               0
model_id    10553261
type               0
cate               0
brand              0
dtype: int64

In [25]:
action_file_03_pd.describe()

,user_id,sku_id,model_id,type,cate,brand
count,2.591638e+07,2.591638e+07,1.536312e+07,2.591638e+07,2.591638e+07,2.591638e+07
mean,2.508570e+05,8.320493e+04,8.947558e+01,4.064853e+00,6.632481e+00,4.285184e+02
std,3.003676e+04,4.977765e+04,1.019552e+02,2.417549e+00,1.755576e+00,2.419947e+02
min,2.000010e+05,2.000000e+00,0.000000e+00,1.000000e+00,4.000000e+00,4.000000e+00
25%,2.250010e+05,3.983000e+04,0.000000e+00,1.000000e+00,5.000000e+00,2.140000e+02
50%,2.492680e+05,7.952000e+04,2.600000e+01,6.000000e+00,7.000000e+00,4.530000e+02
75%,2.766870e+05,1.267910e+05,2.160000e+02,6.000000e+00,8.000000e+00,6.230000e+02
max,3.053210e+05,1.712250e+05,3.480000e+02,6.000000e+00,1.100000e+01,9.230000e+02

In [26]:
action_file_04 = "../data/jddata/JData_Action_201604.csv"

In [27]:
action_file_04_pd = pd.read_csv(action_file_04)

In [28]:
action_file_04_pd.shape

(13199934, 7)

In [29]:
action_file_04_pd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13199934 entries, 0 to 13199933
Data columns (total 7 columns):
 #   Column    Dtype
---  ------    -----
 0   user_id   int64
 1   sku_id    int64
 2   time      object
 3   model_id  float64
 4   type      int64
 5   cate      int64
 6   brand     int64
dtypes: float64(1), int64(5), object(1)
memory usage: 705.0+ MB

In [30]:
action_file_04_pd.isna().sum()

user_id           0
sku_id            0
time              0
model_id    5143018
type              0
cate              0
brand             0
dtype: int64

In [31]:
action_file_04_pd[action_file_04_pd.model_id.isna()]

          user_id  sku_id                 time  model_id  type  cate  brand
1          208266   31662  2016-03-31 23:59:04       NaN     1     8    545
3          237311    5825  2016-03-31 23:59:05       NaN     1     8    885
4          257651  128104  2016-03-31 23:59:05       NaN     1     4    300
11         230578  162108  2016-03-31 23:59:09       NaN     1     4    306
12         208266   42199  2016-03-31 23:59:09       NaN     1     8    545
...           ...     ...                  ...       ...   ...   ...    ...
13199923   236482    7199  2016-04-15 23:59:57       NaN     1     4    306
13199924   236482    7199  2016-04-15 23:59:57       NaN     1     4    306
13199926   236482   37009  2016-04-15 23:59:57       NaN     1     4    581
13199927   236482   37009  2016-04-15 23:59:57       NaN     1     4    581
13199933   251186   35464  2016-04-15 23:59:59       NaN     2     5    489

[5143018 rows x 7 columns]

In [32]:
action_file_04_pd.describe()

,user_id,sku_id,model_id,type,cate,brand
count,1.319993e+07,1.319993e+07,8.056916e+06,1.319993e+07,1.319993e+07,1.319993e+07
mean,2.509635e+05,8.344591e+04,9.524445e+01,4.146564e+00,6.571679e+00,4.410705e+02
std,3.009638e+04,4.931126e+04,1.033112e+02,2.395629e+00,1.785305e+00,2.399955e+02
min,2.000010e+05,2.000000e+00,0.000000e+00,1.000000e+00,4.000000e+00,4.000000e+00
25%,2.251310e+05,4.033600e+04,0.000000e+00,1.000000e+00,5.000000e+00,2.140000e+02
50%,2.493220e+05,7.908000e+04,2.600000e+01,6.000000e+00,7.000000e+00,4.890000e+02
75%,2.770750e+05,1.269060e+05,2.160000e+02,6.000000e+00,8.000000e+00,5.970000e+02
max,3.053200e+05,1.712250e+05,3.400000e+02,6.000000e+00,1.100000e+01,9.230000e+02

数据集验证

In [33]:
user_action_02 = pd.merge(user_file_pd, action_file_02_pd, on="user_id")

In [47]:
user_action_02.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11485424 entries, 0 to 11485423
Data columns (total 11 columns):
 #   Column       Dtype
---  ------       -----
 0   user_id      int64
 1   age          float64
 2   sex          float64
 3   user_lv_cd   int64
 4   user_reg_tm  object
 5   sku_id       int64
 6   time         object
 7   model_id     float64
 8   type         int64
 9   cate         int64
 10  brand        int64
dtypes: float64(3), int64(6), object(2)
memory usage: 963.9+ MB

In [ ]:
user_action_02.user_id.unique().size
# 注册的用户，在02月份没有购买记录

73299

In [54]:
user_action_03 = pd.merge(user_file_pd, action_file_03_pd, on="user_id")

In [55]:
user_action_03.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25916378 entries, 0 to 25916377
Data columns (total 11 columns):
 #   Column       Dtype
---  ------       -----
 0   user_id      int64
 1   age          float64
 2   sex          float64
 3   user_lv_cd   int64
 4   user_reg_tm  object
 5   sku_id       int64
 6   time         object
 7   model_id     float64
 8   type         int64
 9   cate         int64
 10  brand        int64
dtypes: float64(3), int64(6), object(2)
memory usage: 2.1+ GB

In [ ]:
user_action_03.user_id.unique().size
# 注册的用户，在03月份没有购买记录

96087

In [ ]:
action_file_02_pd.user_id.isin(user_file_pd.user_id).sum()
# action_file_02的user_id都在user_file的user_id中

11485424

In [ ]:
action_file_03_pd.user_id.isin(user_file_pd.user_id).sum()
# action_file_03的user_id都在user_file的user_id中

25916378

In [ ]:
action_file_04_pd.user_id.isin(user_file_pd.user_id).sum()
# action_file_04的user_id都在user_file的user_id中

13199934

In [64]:
action_file_02_pd.sku_id.isin(product_file_pd.sku_id).sum()
# action_file_02的sku_id都在product_file的sku_id中

3194275

In [65]:
action_file_03_pd.sku_id.isin(product_file_pd.sku_id).sum()
# action_file_03的sku_id都在product_file的sku_id中

9693970

In [66]:
action_file_04_pd.sku_id.isin(product_file_pd.sku_id).sum()
# action_file_04的sku_id都在product_file的sku_id中

5239810

In [70]:
action_file_02_pd.sku_id.isin(product_file_pd.sku_id)
# action_file_02的sku_id都在product_file的sku_id中

0            True
1            True
2            True
3            True
4           False
            ...
11485419     True
11485420    False
11485421     True
11485422     True
11485423     True
Name: sku_id, Length: 11485424, dtype: bool

In [76]:
action_file_02_pd[action_file_02_pd.sku_id.isin(product_file_pd.sku_id)]
# action_file_02的sku_id都在product_file的sku_id中

          user_id  sku_id                 time  model_id  type  cate  brand
0          266079  138778  2016-01-31 23:59:02       NaN     1     8    403
1          266079  138778  2016-01-31 23:59:03       0.0     6     8    403
2          200719   61226  2016-01-31 23:59:07       NaN     1     8     30
3          200719   61226  2016-01-31 23:59:08       0.0     6     8     30
13         209278    6998  2016-01-31 23:59:25       0.0     6     8    545
...           ...     ...                  ...       ...   ...   ...    ...
11485418   213906  103132  2016-02-29 23:59:59     217.0     6     8    545
11485419   213906  103132  2016-02-29 23:59:59     216.0     6     8    545
11485421   213906  103132  2016-02-29 23:59:59       0.0     6     8    545
11485422   213906  103132  2016-02-29 23:59:59       0.0     6     8    545
11485423   213906  103132  2016-02-29 23:59:59     217.0     6     8    545

[3194275 rows x 7 columns]

In [72]:
action_file_02_pd[~action_file_02_pd.sku_id.isin(product_file_pd.sku_id)]
# action_file_02的sku_id都在product_file的sku_id中

          user_id  sku_id                 time  model_id  type  cate  brand
4          263587   72348  2016-01-31 23:59:08       NaN     1     5    159
5          296130  103126  2016-01-31 23:59:11       NaN     1     4    174
6          296130  103126  2016-01-31 23:59:11       0.0     6     4    174
7          296130  103126  2016-01-31 23:59:11       0.0     6     4    174
8          217892  137328  2016-01-31 23:59:14     111.0     6     6    159
...           ...     ...                  ...       ...   ...   ...    ...
11485398   278856  153390  2016-02-29 23:59:56     211.0     6     7    157
11485399   278856  153390  2016-02-29 23:59:56     218.0     6     7    157
11485400   263603  114890  2016-02-29 23:59:56       NaN     1     9    640
11485401   263603  114890  2016-02-29 23:59:56       0.0     6     9    640
11485420   301058   20869  2016-02-29 23:59:59       NaN     2     9    630

[8291149 rows x 7 columns]

In [80]:
72348 in product_file_pd.sku_id.values

False

In [82]:
comment_file_pd.sku_id.isin(product_file_pd.sku_id).sum()

81960

In [34]:
action_file_02_pd.user_id.isin(user_file_pd.user_id).sum()

11485424

In [35]:
action_file_03_pd.user_id.isin(user_file_pd.user_id).sum()

25916378

In [36]:
action_file_04_pd.user_id.isin(user_file_pd.user_id).sum()

13199934

删除重复数据

In [43]:
def drop_duplicate_record(data, file_name):
    num_before = data.shape[0]

    data_new = data.drop_duplicates()

    num_after = data_new.shape[0]
    num_drop = num_before - num_after

    print(f"数据文件 {file_name}，删除重复记录：{num_drop} 条")

    return data_new

In [38]:
user_file_new = drop_duplicate_record(user_file_pd, "JData_User.csv")

数据文件 JData_User.csv，删除重复记录：0 条

In [39]:
product_file_new = drop_duplicate_record(product_file_pd, "JData_Product.csv")

数据文件 JData_Product.csv，删除重复记录：0 条

In [40]:
comment_file_new = drop_duplicate_record(comment_file_pd, "JData_Comment.csv")

数据文件 JData_Comment.csv，删除重复记录：0 条

In [44]:
action_02_new = drop_duplicate_record(action_file_02_pd, "JData_Action_201602.csv")

数据文件 JData_Action_201602.csv，删除重复记录：2756093 条

In [45]:
action_03_new = drop_duplicate_record(action_file_03_pd, "JData_Action_201603.csv")

数据文件 JData_Action_201603.csv，删除重复记录：7085038 条

In [46]:
action_04_new = drop_duplicate_record(action_file_04_pd, "JData_Action_201604.csv")

数据文件 JData_Action_201604.csv，删除重复记录：3672710 条

In [47]:
user_file_new.describe()

             user_id            age            sex     user_lv_cd
count  105321.000000  105318.000000  105318.000000  105321.000000
mean   252661.000000       2.773448       1.112887       3.850030
std     30403.698188       1.672182       0.955930       1.071505
min    200001.000000      -1.000000       0.000000       1.000000
25%    226331.000000       3.000000       0.000000       3.000000
50%    252661.000000       3.000000       2.000000       4.000000
75%    278991.000000       4.000000       2.000000       5.000000
max    305321.000000       6.000000       2.000000       5.000000